core/src/main/resources/order_template/roamingvoice.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:oed="http://tot.co.th/totom/interface/oedata">
   <soapenv:Header/>
   <soapenv:Body>
      <oed:SubmitRequest>
         <OrderId>{2}</OrderId>
         <SourceSystemId>OMWeb</SourceSystemId>
         <OrderUserId>{3}</OrderUserId>
         <OrderDateTime>{1}</OrderDateTime>
         <OrderType>SUBMIT</OrderType>
         <OperationCode>MODBARSTATE</OperationCode>
         <OrderItems>
            <OrderItem>
               <OrderItemType>ACCESS</OrderItemType>
               <OrderItemAction>MOD</OrderItemAction>
               <OrderItemId>ACCESS{2}</OrderItemId>
               <OrderItemParentId/>
            </OrderItem>
            <OrderItem>
               <OrderItemType>SERVICE</OrderItemType>
               <OrderItemAction>MOD</OrderItemAction>
               <OrderItemId>SERVICE{2}</OrderItemId>
               <OrderItemParentId>ACCESS{2}</OrderItemParentId>
               <Attributes>
                  <Attribute>
                     <Name>ServiceId</Name>
                     <Value>Voice Originating</Value>
                  </Attribute>
                  <Attribute>
                     <Name>Barring_out</Name>
                     <Value>{5}</Value>
                  </Attribute>
                  <Attribute>
                     <Name>Barring_in</Name>
                     <Value>0</Value>
                  </Attribute>
               </Attributes>
            </OrderItem>
            <OrderItem>
               <OrderItemType>SERVICE</OrderItemType>
               <OrderItemAction>MOD</OrderItemAction>
               <OrderItemId>SERVICE1{2}</OrderItemId>
               <OrderItemParentId>ACCESS{2}</OrderItemParentId>
               <Attributes>
                  <Attribute>
                     <Name>ServiceId</Name>
                     <Value>Domestic Roaming</Value>
                  </Attribute>
                  <Attribute>
                     <Name>Barring</Name>
                     <Value>{4}</Value>
                  </Attribute>
               </Attributes>
            </OrderItem>            
            <OrderItem>
               <OrderItemType>MSISDN</OrderItemType>
               <OrderItemAction>REF</OrderItemAction>
               <OrderItemId>MSISDN{2}</OrderItemId>
               <OrderItemParentId>ACCESS{2}</OrderItemParentId>
               <Attributes>
                  <Attribute>
                     <Name>Number</Name>
                     <Value>{0}</Value>
                  </Attribute>
               </Attributes>
	       </OrderItem>
	   </OrderItems>
      </oed:SubmitRequest>
   </soapenv:Body>
</soapenv:Envelope>